//เขียนฟังก์ชัน login ตรวจสอบสิทธิ์
function login(inputUser, inputPass, role, isActive, age) {
    
    //ตรวจ username หรือ password ไม่ถูกต้อง  ใช้ || or เพราะถ้าผิดแค่ตัวเดียวก็ = ผิดทั้งหมด
    if (inputUser !== "admin" || inputPass !== "ce385pass") {
        return "ชื่อผู้ใช้หรือรหัสผ่านไม่ถูกต้อง";
    }
    //ตรวจสถานะบัญชี isActive ถ้าเป็น false = บัญชีถูกระงับการใช้งาน
    if (isActive === false) { 
        return "บัญชีถูกระงับการใช้งาน";
    }
    
    if (age < 18) {
        return "อายุไม่ถึงเกณฑ์";//ตรวจอายุ
    }
    
    if (role === "อาจารย์") {  //กำหนดว่าผ่านแต่เป็นอาจารย์
        return "เข้าสู่ระบบสำเร็จ (สิทธิ์ผู้ดูแล)"; 
    }
    
    if (role === "นักศึกษา") {  //กำหนดว่าผ่านแต่เป็นนักศึกษา
        return "เข้าสู่ระบบสำเร็จ (สิทธิ์ทั่วไป)";
    }

    return "ไม่มีสิทธิ์เข้าถึงระบบ"; //กำหนดถ้า role ไม่ตรงกับอะไรเลย
}

console.log("=== ทดสอบการเข้าสู่ระบบ ==="); //ทดสอบระบบ 6 กรณี

//เข้าสู่ระบบได้(อาจารย์) ชื่อและรหัสถูก, ไม่โดนแบน, อายุเกิน 18, role อาจารย์
console.log("Test 1:", login("admin", "ce385pass", "อาจารย์", true, 35)); 

//เข้าสู่ระบบได้(นักศึกษา) รหัสถูก, ไม่โดนแบน, อายุเกิน 18, role นักศึกษา
console.log("Test 2:", login("admin", "ce385pass", "นักศึกษา", true, 20)); 

//รหัสผ่านผิด ระบบตอบกลับว่า ชื่อหรือรหัสไม่ถูก เด้งออกทันที
console.log("Test 3:", login("admin", "wrongpass123", "นักศึกษา", true, 20)); 

//ชื่อผู้ใช้ผิด ระบบตอบกลับว่า ชื่อหรือรหัสไม่ถูก เด้งออกทันที) 
console.log("Test 4:", login("hacker", "ce385pass", "อาจารย์", true, 40)); 

//บัญชีถูกระงับ ชื่อและรหัสถูกหมด แต่ isActive เป็น false)
console.log("Test 5:", login("admin", "ce385pass", "นักศึกษา", false, 21)); 

//อายุไม่ถึงเกณฑ์ ทุกอย่งถูกแต่อายุ 15
console.log("Test 6:", login("admin", "ce385pass", "นักศึกษา", true, 15)); 


/*
---  ตอบคำถาม ---

1. ทำไมต้องตรวจ username/password ก่อนตรวจ role
ตอบ : เพื่อดูว่ามี Account อยู่จริงๆ และค่อยเช็คว่าเป็นอาจารย์หรือนักศึกษาโดนแบนรึปาว
        หากเช็ค Role ก่อนมีสิทธ์ที่จะโดนแฮ็คได้ผ่านการ Run ผ่านหลังบ้านโดนตรง


2.ถ้าย้ายการตรวจ "อายุไม่ถึงเกณฑ์" ขึ้นไปเป็นข้อแรก จะเกิดปัญหาอะไร (คิดในแง่ความปลอดภัย: เราจะบอกอะไรกับคนที่ยังไม่ได้พิสูจน์ตัวตน)
ตอบ : ทำให้เดารหัสง่ายขึ้นเสี่ยงต่อการโดนแฮ็คมากขึ้น เช่น หากต้องการ Accountของอาจารย์(สิทธิ์ผู้ดูแล) เพื่อจะเข้าระบบไปเปลี่ยนผลคะแนนสอบ
        หากเดาผิดก็จะขึ่นว่า อายุไม่ถึง ทำให้รู้ว่า Account นั้นไม่ใช่ของอาจารย์แน่นอน ทำให้ง่ายต่อการหามากขึ้น

*/